IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_aes_regs.xml
<module id="AES_REGS" HW_revision="" description="AES Registers">
	<register id="AES_KEY2_6" width="32" page="1" offset="0x0" internal="0" description="XTS Second Key or CBC-MAC Third Key">
		<bitfield id="KEY" description="AES_KEY2[223:192] / AES_KEY3[95:64]" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY2_7" width="32" page="1" offset="0x4" internal="0" description="XTS Second Key or CBC-MAC Third Key">
		<bitfield id="KEY" description="AES_KEY2[255:224] / AES_KEY3[127:96]" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY2_4" width="32" page="1" offset="0x8" internal="0" description="XTS/CCM Second Key or CBC-MAC Third Key">
		<bitfield id="KEY" description="AES_KEY2[159:128] / AES_KEY3[31:0]" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY2_5" width="32" page="1" offset="0xc" internal="0" description="XTS Second Key or CBC-MAC Third Key">
		<bitfield id="KEY" description="AES_KEY2[191:160] / AES_KEY3[63:32]" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY2_2" width="32" page="1" offset="0x10" internal="0" description="XTS/CCM/CBC-MAC Second Key or Hash Key Input">
		<bitfield id="KEY" description="AES_KEY2/AES_GHASH_H[95:64]" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY2_3" width="32" page="1" offset="0x14" internal="0" description="XTS/CCM/CBC-MAC Second Key or Hash Key Input">
		<bitfield id="KEY" description="AES_KEY2/AES_GHASH_H[127:96]" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY2_0" width="32" page="1" offset="0x18" internal="0" description="XTS/CCM/CBC-MAC Second Key or Hash Key Input">
		<bitfield id="KEY" description="AES_KEY2/AES_GHASH_H[31:0]" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY2_1" width="32" page="1" offset="0x1c" internal="0" description="XTS/CCM/CBC-MAC Second Key or Hash Key Input">
		<bitfield id="KEY" description="AES_KEY2/AES_GHASH_H[63:32]" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY1_6" width="32" page="1" offset="0x20" internal="0" description="Key">
		<bitfield id="KEY" description="Key Data" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY1_7" width="32" page="1" offset="0x24" internal="0" description="Key">
		<bitfield id="KEY" description="Key Data" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY1_4" width="32" page="1" offset="0x28" internal="0" description="Key">
		<bitfield id="KEY" description="Key Data" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY1_5" width="32" page="1" offset="0x2c" internal="0" description="Key">
		<bitfield id="KEY" description="Key Data" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY1_2" width="32" page="1" offset="0x30" internal="0" description="Key">
		<bitfield id="KEY" description="Key Data" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY1_3" width="32" page="1" offset="0x34" internal="0" description="Key">
		<bitfield id="KEY" description="Key Data" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY1_0" width="32" page="1" offset="0x38" internal="0" description="Key">
		<bitfield id="KEY" description="Key Data" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_KEY1_1" width="32" page="1" offset="0x3c" internal="0" description="Key">
		<bitfield id="KEY" description="Key Data" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_IV_IN_OUT_0" width="32" page="1" offset="0x40" internal="0" description="Initialization Vector 0">
		<bitfield id="DATA" description="Initialization Vector Input" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_IV_IN_OUT_1" width="32" page="1" offset="0x44" internal="0" description="Initialization Vector 1">
		<bitfield id="DATA" description="Initialization Vector Input" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_IV_IN_OUT_2" width="32" page="1" offset="0x48" internal="0" description="Initialization Vector 2">
		<bitfield id="DATA" description="Initialization Vector Input" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_IV_IN_OUT_3" width="32" page="1" offset="0x4c" internal="0" description="Initialization Vector 3">
		<bitfield id="DATA" description="Initialization Vector Input" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_CTRL" width="32" page="1" offset="0x50" internal="0" description="Input/Output Buffer Control and Mode Selection">
		<bitfield id="OUTPUT_READY" description="Output Ready Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INPUT_READY" description="Input Ready Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="DIRECTION" description="Encryption/Decryption Selection" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="KEY_SIZE" description="Key Size" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="MODE" description="ECB/CBC Mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CTR" description="Counter Mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CTR_WIDTH" description="AES-CTR Mode Counter Width" begin="8" end="7" width="2" rwaccess="RW"/>
		<bitfield id="ICM" description="AES Integer Counter Mode (ICM) Enable " begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CFB" description="Full block AES cipher feedback mode (CFB128) Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="XTS" description="AES-XTS Operation Enable" begin="12" end="11" width="2" rwaccess="RW"/>
		<bitfield id="F8" description="AES f8 Mode Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="F9" description="AES f9 Mode Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CBCMAC" description="AES-CBC MAC Enable" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GCM" description="AES-GCM Mode Enable" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="CCM" description="AES-CCM Mode Enable" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CCM_L" description="Width of the length field for CCM operations" begin="21" end="19" width="3" rwaccess="RW"/>
		<bitfield id="CCM_M" description="Length of the authentication field for CCM operations" begin="24" end="22" width="3" rwaccess="RW"/>
		<bitfield id="SAVE_CONTEXT" description="TAG or Result IV Save" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SVCTXTRDY" description="AES TAG/IV Block(s) Ready" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="CTXTRDY" description="Context Data Registers Ready" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="AES_C_LENGTH_0" width="32" page="1" offset="0x54" internal="0" description="Crypto Data Length 0">
		<bitfield id="LENGTH" description=" Cryptographic data length in bytes" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_C_LENGTH_1" width="32" page="1" offset="0x58" internal="0" description="Crypto Data Length 1">
		<bitfield id="LENGTH" description="Cryptographic data length in bytes for all modes." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_AUTH_LENGTH" width="32" page="1" offset="0x5c" internal="0" description="AAD Data Length">
		<bitfield id="AUTH" description="Authentication Data Length" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_DATA_IN_OUT_0" width="32" page="1" offset="0x60" internal="0" description="Data Word 0">
		<bitfield id="DATA" description="Secure Data RW" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_DATA_IN_OUT_1" width="32" page="1" offset="0x64" internal="0" description="Data Word 1">
		<bitfield id="DATA" description="Secure Data RW" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_DATA_IN_OUT_2" width="32" page="1" offset="0x68" internal="0" description="Data Word 2">
		<bitfield id="DATA" description="Secure Data RW" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_DATA_IN_OUT_3" width="32" page="1" offset="0x6c" internal="0" description="Data Word 3">
		<bitfield id="DATA" description="Secure Data RW" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="AES_TAG_OUT_0" width="32" page="1" offset="0x70" internal="0" description="Hash Result 0">
		<bitfield id="HASH" description="Hash Result" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="AES_TAG_OUT_1" width="32" page="1" offset="0x74" internal="0" description="Hash Result 1">
		<bitfield id="HASH" description="Hash Result" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="AES_TAG_OUT_2" width="32" page="1" offset="0x78" internal="0" description="Hash Result 2">
		<bitfield id="HASH" description="Hash Result" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="AES_TAG_OUT_3" width="32" page="1" offset="0x7c" internal="0" description="Hash Result 3">
		<bitfield id="HASH" description="Hash Result" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="AES_REV" width="32" page="1" offset="0x80" internal="0" description="Module Revision Number">
		<bitfield id="REVISION" description="Revision number" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="AES_SYSCONFIG" width="32" page="1" offset="0x84" internal="0" description="System Configuration">
		<bitfield id="AUTOIDLE" description="autoidle" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOFTRESET" description="Soft Reset" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SIDLE" description="Slave Idle Mode" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA_REQ_DATA_IN_EN" description="DMA Request Data In Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_DATA_OUT_EN" description="DMA Request Data Out Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_CONTEXT_IN_EN" description="DMA Request Context In Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_CONTEXT_OUT_EN" description="DMA Request Context Out Enable " begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MAP_CONTEXT_OUT_ON_DATA_OUT" description="Map Context Out on Data Out Enable" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="AES_SYSSTATUS" width="32" page="1" offset="0x88" internal="0" description="Reset Status">
		<bitfield id="RESETDONE" description="Reset Done" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="AES_IRQSTATUS" width="32" page="1" offset="0x8c" internal="0" description="Interrupt Status">
		<bitfield id="CONTEXT_IN" description="Context In Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="DATA_IN" description="Data In Interrupt Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="DATA_OUT" description="Data Out Interrupt Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CONTEXT_OUT" description="Context Output Interrupt Status" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="AES_IRQENABLE" width="32" page="1" offset="0x90" internal="0" description="Interrupt Enable">
		<bitfield id="CONTEXT_IN" description="Context In Interrupt Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DATA_IN" description="Data In Interrupt Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DATA_OUT" description="Data Out Interrupt Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CONTEXT_OUT" description="Context Out Interrupt Enable" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="AES_DIRTY_BITS" width="32" page="1" offset="0x94" internal="0" description="Accessed / Dirty Bits">
		<bitfield id="S_ACCESS" description="AES Access Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="S_DIRTY" description="AES Dirty Bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
</module>
